In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv("../data/processed/cleaned_train.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,S

FamilySize = SibSp + Parch + 1

In [3]:
df["FamilySize"] = df["SibSp"] + df["Parch"] + 1
df[["SibSp", "Parch", "FamilySize"]].head()

   SibSp  Parch  FamilySize
0      1      0           2
1      1      0           2
2      0      0           1
3      1      0           2
4      0      0           1

This feature captures social support, not raw counts.

In [4]:
df["IsAlone"] = 0
df.loc[df["FamilySize"] == 1, "IsAlone"] = 1

df[["FamilySize", "IsAlone"]].head()

   FamilySize  IsAlone
0           2        0
1           2        0
2           1        1
3           2        0
4           1        1

Binary features often help linear models.

In [5]:
df["Title"] = df["Name"].str.extract(r" ([A-Za-z]+)\.", expand=False)
df["Title"].value_counts()

Title
Mr          517
Miss        182
Mrs         125
Master       40
Dr            7
Rev           6
Col           2
Mlle          2
Major         2
Ms            1
Mme           1
Don           1
Lady          1
Sir           1
Capt          1
Countess      1
Jonkheer      1
Name: count, dtype: int64

Titles reflect:
Age group (Master = child)
Gender
Social status

In [6]:
rare_titles = ["Lady", "Countess", "Capt", "Col",
               "Don", "Dr", "Major", "Rev",
               "Sir", "Jonkheer", "Dona"]

df["Title"] = df["Title"].replace(rare_titles, "Rare")
df["Title"] = df["Title"].replace({"Mlle": "Miss", "Ms": "Miss", "Mme": "Mrs"})

df["Title"].value_counts()

Title
Mr        517
Miss      185
Mrs       126
Master     40
Rare       23
Name: count, dtype: int64

This improves generalization

In [7]:
df.drop(columns=["Name"], inplace=True)

 drop because We extracted all useful info from Name.

In [14]:
df.head()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare,FamilySize,IsAlone,Sex_male,Embarked_Q,Embarked_S,Title_Miss,Title_Mr,Title_Mrs,Title_Rare
0,1,0,3,22.0,1,0,7.2500,2,0,1,0,1,0,1,0,0
1,2,1,1,38.0,1,0,71.2833,2,0,0,0,0,0,0,1,0
2,3,1,3,26.0,0,0,7.9250,1,1,0,0,1,1,0,0,0
3,4,1,1,35.0,1,0,53.1000,2,0,0,0,1,0,0,1,0
4,5,0,3,35.0,0,0,8.0500,1,1,1,0,1,0,1,0,0

In [10]:
df.drop(columns=["Ticket"], inplace=True)

In [11]:
bool_cols = df.select_dtypes(include="bool").columns
df[bool_cols] = df[bool_cols].astype(int)

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 16 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Age          891 non-null    float64
 4   SibSp        891 non-null    int64
 5   Parch        891 non-null    int64
 6   Fare         891 non-null    float64
 7   FamilySize   891 non-null    int64
 8   IsAlone      891 non-null    int64
 9   Sex_male     891 non-null    int64
 10  Embarked_Q   891 non-null    int64
 11  Embarked_S   891 non-null    int64
 12  Title_Miss   891 non-null    int64
 13  Title_Mr     891 non-null    int64
 14  Title_Mrs    891 non-null    int64
 15  Title_Rare   891 non-null    int64
dtypes: float64(2), int64(14)
memory usage: 111.5 KB

In [15]:
df.to_csv("../data/processed/featured_train.csv", index=False)
print("✅ Dataset is now fully numeric and model-ready.")

✅ Dataset is now fully numeric and model-ready.